## Performing Total Aggregations

Let us understand how to perform total or global aggregations using Pandas.

In [2]:
%run 06_csv_to_pandas_data_frame.ipynb

### Global Aggregations

There are several global aggregations that can be performed.
  * Getting number of records in the Data Frame.

In [ ]:
orders.shape

In [ ]:
orders.shape[0]

* Getting number of non np.NaN values in each attribute in a Data Frame

In [ ]:
orders.count()

In [ ]:
type(orders.count())

In [ ]:
orders.count()['order_id']

* Getting basic statistics of numeric fields of a Data Frame

In [ ]:
orders.describe()

* Get revenue for order id 2 from order_items

In [ ]:
order_items[order_items.order_item_order_id == 2].order_item_subtotal.sum()

### Task 1
Use orders and get total number of records for a given month (201401).

In [28]:
orders

       order_id             order_date  order_customer_id     order_status
0             1  2013-07-25 00:00:00.0              11599           CLOSED
1             2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2             3  2013-07-25 00:00:00.0              12111         COMPLETE
3             4  2013-07-25 00:00:00.0               8827           CLOSED
4             5  2013-07-25 00:00:00.0              11318         COMPLETE
...         ...                    ...                ...              ...
68878     68879  2014-07-09 00:00:00.0                778         COMPLETE
68879     68880  2014-07-13 00:00:00.0               1117         COMPLETE
68880     68881  2014-07-19 00:00:00.0               2518  PENDING_PAYMENT
68881     68882  2014-07-22 00:00:00.0              10000          ON_HOLD
68882     68883  2014-07-23 00:00:00.0               5533         COMPLETE

[68883 rows x 4 columns]

In [43]:
orders.order_date

0        2013-07-25 00:00:00.0
1        2013-07-25 00:00:00.0
2        2013-07-25 00:00:00.0
3        2013-07-25 00:00:00.0
4        2013-07-25 00:00:00.0
                 ...
68878    2014-07-09 00:00:00.0
68879    2014-07-13 00:00:00.0
68880    2014-07-19 00:00:00.0
68881    2014-07-22 00:00:00.0
68882    2014-07-23 00:00:00.0
Name: order_date, Length: 68883, dtype: object

In [52]:
orders[orders['order_date'].str.slice(0, 7).str.replace('-', '').astype('int64') == 201401]

       order_id             order_date  order_customer_id     order_status
25875     25876  2014-01-01 00:00:00.0               3414  PENDING_PAYMENT
25876     25877  2014-01-01 00:00:00.0               5549  PENDING_PAYMENT
25877     25878  2014-01-01 00:00:00.0               9084          PENDING
25878     25879  2014-01-01 00:00:00.0               5118          PENDING
25879     25880  2014-01-01 00:00:00.0              10146         CANCELED
...         ...                    ...                ...              ...
68789     68790  2014-01-26 00:00:00.0              10302           CLOSED
68790     68791  2014-01-27 00:00:00.0               6524         COMPLETE
68791     68792  2014-01-28 00:00:00.0               9809         CANCELED
68792     68793  2014-01-30 00:00:00.0               5654         COMPLETE
68793     68794  2014-01-31 00:00:00.0               6873         COMPLETE

[5908 rows x 4 columns]

### Task 2

Use order_items data set and compute total revenue generated for a given product_id.

In [17]:
order_items

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,1,957,1,299.98,299.98
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00
3,4,2,403,1,129.99,129.99
4,5,4,897,2,49.98,24.99
...,...,...,...,...,...,...
172193,172194,68881,403,1,129.99,129.99
172194,172195,68882,365,1,59.99,59.99
172195,172196,68882,502,1,50.00,50.00
172196,172197,68883,208,1,1999.99,1999.99
172197,172198,68883,502,3,150.00,50.00

In [26]:
order_items.query('order_item_product_id == 502')['order_item_subtotal'].sum()

3147800.0

In [27]:
order_items.query('order_item_product_id == 502').order_item_subtotal.sum()

3147800.0

### Task 3

Use order_items data set and get total number of items sold as well as total revenue generated for a given product_id.

In [17]:
order_items

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,1,957,1,299.98,299.98
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00
3,4,2,403,1,129.99,129.99
4,5,4,897,2,49.98,24.99
...,...,...,...,...,...,...
172193,172194,68881,403,1,129.99,129.99
172194,172195,68882,365,1,59.99,59.99
172195,172196,68882,502,1,50.00,50.00
172196,172197,68883,208,1,1999.99,1999.99
172197,172198,68883,502,3,150.00,50.00

In [18]:
order_items_for_product_id = order_items.query('order_item_product_id == 502')

In [25]:
order_items_for_product_id[['order_item_quantity', 'order_item_subtotal']].sum()

order_item_quantity      62956.0
order_item_subtotal    3147800.0
dtype: float64

In [23]:
tuple(order_items_for_product_id[['order_item_quantity', 'order_item_subtotal']].sum())

(62956.0, 3147800.0)

In [24]:
dict(order_items_for_product_id[['order_item_quantity', 'order_item_subtotal']].sum())

{'order_item_quantity': 62956.0, 'order_item_subtotal': 3147800.0}

### Task 4

Create a collection with sales and commission percentage. Using that collection compute total commission amount. If the commission percent is None or not present, treat it as 0.
* Each element in the collection should be a tuple.
* First element is the sales amount and second element is commission percentage.
* Commission for each sale can be computed by multiplying commission percentage with sales (make sure to divide commission percentage by 100).
* Some of the records does not have commission percentage, in that case commission amount for that sale shall be 0

In [3]:
transactions = [(376.0, 8),
(548.23, 14),
(107.93, 8),
(838.22, 14),
(846.85, 21),
(234.84,),
(850.2, 21),
(992.2, 21),
(267.01,),
(958.91, 21),
(412.59,),
(283.14,),
(350.01, 14),
(226.95,),
(132.7, 14)]

In [4]:
sales = pd.DataFrame(transactions, columns=['sale_amount', 'commission_pct'])

In [5]:
sales

    sale_amount  commission_pct
0        376.00             8.0
1        548.23            14.0
2        107.93             8.0
3        838.22            14.0
4        846.85            21.0
5        234.84             NaN
6        850.20            21.0
7        992.20            21.0
8        267.01             NaN
9        958.91            21.0
10       412.59             NaN
11       283.14             NaN
12       350.01            14.0
13       226.95             NaN
14       132.70            14.0

In [8]:
sales_filled = sales.fillna(0.0)

In [12]:
(sales_filled['sale_amount'] * sales_filled['commission_pct']).sum().round(2)

106651.04

### By Key Aggregations

By Key Aggregations are those which are computed per key. Here are some of the examples.
* Getting number of orders per day

In [ ]:
orders.groupby(orders['order_date'])['order_id'].count()

* Getting number of orders per status

In [ ]:
orders.groupby('order_status')['order_status'].count()

* Computing revenue per order

In [ ]:
order_items. \
    groupby('order_item_order_id')['order_item_subtotal']. \
    sum()

In [ ]:
order_items. \
    groupby('order_item_order_id')['order_item_subtotal']. \
    agg(['sum', 'min', 'max', 'count']). \
    rename(columns={'count': 'item_count', 'sum': 'revenue'})

In [ ]:
order_items.rename(columns={'order_item_order_id': 'order_id'})